
{
  "搜尋課程": "Search Courses",
  "登入": "Log In",
  "登出": "Log Out",
  "註冊": "Sign Up",
  "最酷的技能學習平台<br/>從寫程式到 B-box 你都可以在這裡教與學！<br/>A platform for learning and teaching skill.": "Excellent platform for learning and teaching<br/>Become a master in coding, B-boxing, or more...",
  "上課三步驟": "How to start learning?",
  "根據學習需求找課程": "Find a Course",
  "註冊帳號後，進入「搜尋課程」頁面選擇你要學習的領域，將會立即出現該領域的所有課程。": "Become a member and browse the courses to find the topic that sparks your interest. Too much to choose from? Select a category to find a specific class.",
  "預約與購買課程": "Reserve and Confirm Payment",
  "挑好課程後，可點選行事曆的時段選擇上課時間，並進入「購物車」中確認購買，完成購買流程後會出現「成功扣點」。若您的點數不足請至「點數儲值」頁面先行加值。": "Pick a time slot on your teacher's calendar, then confirm to deduct the points for that class from your account. If you are out of points, just charge your account first.",
  "開始上課": "Start Your Class",
  "課程開始前至「我的行事曆」點選上課時段，可見上課的視訊連結。上課時間進入指定的視訊會議中，就可以開始享受與老師的課程啦！": "Check the course information from My Calendar. Visit the course link when your class is about to start. Sit tight, meet your teacher, and enjoy developing your skills!",
  "上架你的才華，將熱情與技能分享給全世界": "Display your talent, share your passion and skills with members around the world!",
  "成為老師": "Become a Teacher",
  "開始找課程": "Start Learning",
  "您已成功成為老師囉！": "You are logged in as a teacher already.",
  "註冊一個老師身分的帳號，即可成為老師囉！按下確定將帶您前往註冊頁面。": "Register a teacher account to become a teacher. Click OK to go to the registration page.",
  "登入帳戶": "Log In",
  "註冊帳戶": "Sign Up",
  "使用者名稱": "Username",
  "登入用 email": "Login email",
  "聯絡用 email": "Contact email",
  "管理員 email": "Admin login email",
  "身分": "Identity",
  "密碼": "Password",
  "再次確認密碼": "Repeat password",
  "學生": "Student",
  "老師": "Teacher",
  "管理員": "Admin",
  "至少 6 個字元": "6+ characters",
  "請輸入使用者名稱": "Please enter your username",
  "請選擇身分": "Please choose an identity",
  "請輸入登入用 email": "Please enter your login email",
  "請輸入聯絡用 email": "Please enter your contact email",
  "請輸入密碼": "Please enter a password",
  "請再次輸入密碼": "Please re-enter your password",
  "密碼不相符": "Not the same password",
  "網站更新中請稍後再登入": "Website is updating, please log in later",
  "恭喜成為新會員，您將獲得免費的上課點數 1000 點！":"Welcome to this website! We will gift you 1000 points to start your learning path.",
  "點數": "Points",
  "更多資訊": "More",
  "請選擇領域": "select a category",
  "發生了一點錯誤，請稍後再試": "Oops! Something went wrong, please try again later!",
  "目前尚未有領域開放查詢，請稍後再試": "No category available, please try again later!",
  "目前尚未有課程上架，請稍後再試": "No course available, please try again later!",
  "Oops！目前此領域課程尚未上架，先逛逛其他領域吧 ~": "Oops! There is no course in this category yet, check out another category.",
  "購物車": "Shopping Cart",
  "清除失效課程": "Delete invalid courses",
  "我的點數": "My remaining points",
  "點": "",
  "共計": "Total",
  "確認購買": "Confirm",
  "購買": "Yes",
  "刪除": "No",
  "課程名稱": "Course",
  "上課時間": "Time",
  "備註": "Note",
  "我想對老師說...": "Message for the teacher",
  "目前未有課程加入購物車...": "No courses placed in your shopping cart yet.",
  "課程時段重複了，請擇一購買喔！": "Time overlap, please choose only one of these courses.",
  "確認從購物車刪除此課程嗎？": "Do you want to delete this course?",
  "確認從購物車刪除失效課程嗎？": "Do you want to delete the invalid course(s) from your shopping cart?",
  "尚未選擇要確認購買的課程": "No course selected to confirm the payment for.",
  "剩餘點數不足，請先去儲值點數喔！": "You are out of points, please charge your account before you can confirm the payment.",
  "按下確認購買後，將會於您的帳戶扣除點數": "After you click OK, the points will be deducted from your account.",
  "成功扣點！可在行事曆上看到已購買成功的課程喔": "Successfully deducted points! You can check the course on your calendar.",
  "點數儲值": "Points Balance",
  "行事曆": "My Calendar",
  "管理後台": "My Information",
  "錯誤": "Error",
  "開始：": "Start: ",
  "結束：": "End: ",
  "瀏覽此課程頁面": "Check details of the course",
  "課程視訊連結：": "Link to the classroom: ",
  "取消此時段": "Cancel Course",
  "刪除此筆課程紀錄": "Delete Record",
  "老師臨時無法上課，因此取消了此堂課程，系統已經自動將點數退還給你囉！": "The teacher cancelled this course, we have returned the points to your account.",
  "確認要取消這堂課嗎？": "Do you want to cancel this course?",
  "目前無法取消課程，請稍後再試": "Failed to cancel the course, please try again later.",
  "課程取消成功！我們已經將此堂課的課程點數退還給你囉！": "Cancelled this course successfully! We have returned the points from the course to your account.",
  "確認要刪除這筆課程紀錄嗎？": "Do you want to delete this course record?",
  "目前無法刪除這筆課程紀錄，請稍後再試": "Failed to delete the course record, please try again later.",
  "確定取消此時段的課程嗎？系統將通知預約的學生您已取消這堂課！": "Do you want to cancel this course? We will inform the student you have canceled the course.",
  "確定刪除此時段的課程嗎？": "Do you want to delete this course?",
  "預約學生：": "Student: ",
  "預約狀態：": "Status: ",
  "尚無人預約": "No reservation yet",
  "學生備註": "Student's message",
  "刪除此時段": "Delete Course",
  "請先登入才能使用後台功能": "Please log in first.",
  "個人資訊": "Personal Information",
  "課程資訊": "Course Information",
  "取消編輯": "Cancel",
  "編輯個人資訊": "Edit",
  "編輯完成": "Save",
  "尚有欄位未填寫！": "Please fill in the empty field.",
  "Contact Email 格式錯誤！": "The contact email has an invalid format.",
  "尚有欄位未填寫，且 Contact Email 格式錯誤！": "Please fill in the empty field. The contact email has an invalid format.",
  "一切都 OK！發布至前台": "Everything is ready, publish this course on the website",
  "還有資訊需要編輯，暫時不發布": "This course is still under preparation, don't publish it yet",
  "請選擇一個課程領域": "select a category",
  "新增": "Create",
  "審核中": "Pending",
  "審核成功": "Passed",
  "審核失敗": "Failed",
  "課程介紹": "Course Intro",
  "課程點數": "Points",
  "審核狀態": "Status",
  "管理員後台": "Evaluation Board",
  "待審核": "Pending",
  "送出": "Submit",
  "將這堂課加入購物車": "Add the course to cart",
  "溫馨提醒：加入購物車不代表預約成功，請至購物車完成扣點手續，我們才能幫你保留這堂課程喔！": "Reminder: Until you have confirmed your payment in the shopping cart, this course is still available for others.",
  "加入購物車": "Add",
  "加入成功！請至購物車結帳吧！": "Successfully added, please go to the shopping cart and confirm your payment.",
  "學生身份才能使用課程預約功能！請以學生身份登入系統再試一次。": "Only members with a student account can access this function. Please register or log in with a student account.",
  "領域": "Category",
  "單堂點數": "Points",
  "課程時間": "Course Calendar",
  "課程評價": "Comments",
  "目前沒有任何評論": "No comments yet.",
  "尚有欄位未填答，請填寫完後再送出資料": "Fill in the empty field before you submit.",
  "確定要將課程資訊上架到前台嗎？(上架到前台後，任何人都可以瀏覽你的課程頁面，並可預約你的課程)": "Do you want to publish your course on the website? If so, everyone can see your course and make a reservation.",
  "確定要將課程資訊暫時隱藏嗎？(從前台隱藏後，其他人將無法瀏覽你的課程頁面，也無法預約你的課程)": "Do you want to hide your course for now? If so, your course will be invisible to the public. No one can book this course until you publish it.",
  "確定刪除這門課嗎？刪除後的課程資訊將不可回復！": "Do you want to delete the course? Once you delete it, you cannot restore the course information.",
  "無法新增今日以前的課程！": "Cannot add a course to past dates.",
  "新增課程": "Create a New Course",
  "目前擁有的課程": "My Courses",
  "課程已通過審核，設定完課程時段後同學們就可以預約囉！": "The course has passed our evaluation, please set the course time that students can book.",
  "設定課程時段": "Course Time",
  "前往行事曆設定課程時段": "Go to my calendar and set the course time",
  "課程審核中，審核成功後將以電子郵件通知您": "The course is under evaluation. Once our evaluation is finished, we will send you an email with the result.",
  "課程未通過審核，請調整課程資訊後再重新送審": "The course has failed our evaluation, please adjust the content and submit again.",
  "為避免資料遺失，編輯完成的課程資料要記得送審喔！": "To avoid losing your data, please submit your course for evaluation after you finished editing the course information.",
  "刪除課程": "Delete",
  "送審": "Submit for Evaluation",
  "完成編輯": "Save",
  "是否發布課程頁面": "Visibility",
  "瀏覽我的前台頁面": "Public View",
  "前往此門課程的前台頁面": "Check what the course page looks like on the website",
  "你好像還沒有開設課程～點選上方的下拉式選單新增你的第一堂課吧！": "You have no courses yet, click the Create button above to start your first course.",
  "編輯課程資訊": "Edit",
  "此方案大概可以上": "With this plan you can book around",
  "堂課": "course(s)",
  "選擇此方案": "Choose",
  "請用此測試信用卡號結帳": "Please confirm your payment with this credit card number.",
  "注意！結帳時請使用下方測試信用卡資料，請勿輸入您真實的信用卡號": "Warning! Please confirm the payment with the credit card information provided below. Don't enter your real credit card information.",
  "信用卡測試卡號：": "Credit Card Number: ",
  "信用卡測試有效月/年：": "Card Valid Thru: ",
  "信用卡測試安全碼：": "CVV Code: ",
  "優惠方案": "Discount Plans",
  "初體驗": "First Try",
  "小資族": "Affordable",
  "好划算": "Good Deal",
  "超優惠": "Super Discount",
  "初體驗方案": "First Try Plan",
  "小資族方案": "Affordable Plan",
  "好划算方案": "Good Deal Plan",
  "超優惠方案": "Super Discount Plan",
  "這是你的選購資訊：": "This is your purchase information: ",
  "自選儲值額度": "You entered an amount of ",
  "點，需支付": " points and will need to pay $",
  "元，若確認無誤將導向刷卡頁面": ". Please confirm this is correct to be directed to the external payment page.",
  "點 ": " points $",
  "元": "",
  "自行選擇儲值金額": "Enter Another Amount",
  "一元兌換 1 point，儲值額度不得低於 100": "$1 equals 1 point, the minimum amount is $100",
  "請輸入儲值金額": "please enter amount",
  "儲值": "Charge",
  "無法新增過去時間的課程": "Cannot add a course to past dates.",
  "此時段與當天其他時段重疊！": "Overlap between time slots.",
  "課程時間新增失敗": "Failed to create a time slot.",
  "新增一個上課時段": "Add a time slot for your course",
  "課程名稱：": "Course：",
  "開始時間：": "Start：",
  "結束時間：": "End：",
  "設定活動顏色：": "Course color：",
  "確定新增": "Add Time",
  "目前沒有新增課程的權限": "No course to add time slot",
  "請先到後台新增課程，等待資料審核通過後就可以開課囉！": "Please create a new course in My Information. Once your course passed the evaluation, you can start adding time slots.",
  "我知道了": "I understand"
}